Tekla Open API Reference for Tekla Structures 2025
AnalysisDecomposedAreaLoad.Magnitudes Property
 The magnitudes of the decomposed area load.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public List<double> Magnitudes { get; }
Public ReadOnly Property Magnitudes As List(Of Double)
	Get
Property Value
Type: List<Double>
See Also
Reference
AnalysisDecomposedAreaLoad Class
Tekla.Structures.Analysis Namespace